Repository: zipf/perldoc-es
Catalog: memory/clean/omegat_clean_prj-level2.tmx
Source language: en_us
Languages: es

source: =item symbol
es: =item símbolo

source: =item symbol table
es: =item tabla de símbolos

source: =item symbolic debugger
es: =item depurador simbólico

source: =item symbolic link
es: =item vínculo simbólico

source: =item symbolic reference
es: =item referencia simbólica

source: =item synchronous
es: =item sincrónico

source: =item syntactic sugar
es: =item azúcar sintáctico

source: =item syntax
es: =item sintaxis

source: =item syntax tree
es: =item árbol de sintaxis

source: =item syscall
es: =item llamada de sistema

source: =item tainted
es: =item contaminado

source: =item term
es: =item terminal/término

source: =item terminator
es: =item terminador

source: =item ternary
es: =item ternario

source: =item text
es: =item texto

source: =item thread
es: =item hilo de ejecución

source: =item tie
es: =item atadura

source: =item tokener
es: =item tokenizador

source: =item tokenizing
es: =item tokenizar

source: =item toolbox approach
es: =item enfoque de caja de herramientas

source: =item transliterate
es: =item transliterar

source: =item trigger
es: =item desencadenador

source: =item trinary
es: =item trino

source: =item true
es: =item verdadero

source: =item truncating
es: =item truncar

source: =item type
es: =item tipo

source: =item type casting
es: =item conversión de tipo

source: =item typed lexical
es: =item variable léxica con tipo

source: =item typemap
es: =item mapa de tipos

source: =item unary operator
es: =item operador unario

source: =item v-string
es: =item cadena de versión

source: =item value
es: =item valor

source: =item variable interpolation
es: =item interpolación de variables

source: =item variadic
es: =item variádica

source: =item void context
es: =item contexto vacío

source: =item warning
es: =item advertencia

source: =item watch expression
es: =item expresión de inspección

source: =item whitespace
es: =item espacio en blanco

source: =item word
es: =item palabra

source: =item working directory
es: =item directorio de trabajo

source: =item wrapper
es: =item encapsulador

source: =item zero width
es: =item ancho cero

source: > greater than
es: > mayor que

source: >= greater than or equal
es: >= mayor o igual que

source: ? zero or one of the previous thing
es: ? cero o una coincidencias de lo anterior

source: ? Match 1 or 0 times
es: ? 1 o 0 veces

source: ?+ Match 0 or 1 time and give nothing back
es: ?+ 0 o 1 veces sin devolver nada

source: ?: * zero or more /x ignore wh.space
es: ?: * cero o más /x ignorar espacios

source: @EXPORT = qw($FOO); # Usual form, can't be localized
es: @EXPORT = qw($FOO); # Forma usual; no se puede localizar

source: @EXPORT = qw(*FOO); # Can be localized
es: @EXPORT = qw(*FOO); # Se puede localizar

source: @a = ()[1,0]; # @a has no elements
es: @a = ()[1,0]; # @a no tiene elementos

source: @a = (1)[1,0]; # @a has two elements
es: @a = (1)[1,0]; # @a tiene dos elementos

source: @a = qw/first second third/;
es: @a = qw/primero segundo tercero/;

source: @animals[0,1]; # gives ("camel", "llama");
es: @animales[0,1]; # devuelve ("camello", "llama");

source: @animals[0..2]; # gives ("camel", "llama", "owl");
es: @animales[0..2]; # devuelve ("camello", "llama", "búho");

source: @animals[1..$#animals]; # gives all except the first element
es: @animales[1..$#animales]; # devuelve todos excepto el primero

source: @b = (1,undef)[1,0,2]; # @b has three elements
es: @b = (1,undef)[1,0,2]; # @b tiene tres elementos

source: @b = (@a)[0,1]; # @b has no elements
es: @b = (@a)[0,1]; # @b no tiene elementos

source: @c = (0,1)[2,3]; # @c has no elements
es: @c = (0,1)[2,3]; # @c no tiene elementos

source: @chars = split //, $string; # // is not magic in split
es: @chars = split //, $cadena; # // no es mágico en split

source: @colors{'red','blue','green'} = (0xff0000, 0x0000ff, 0x00ff00);
es: @colores{'rojo','azul','verde'} = (0xff0000, 0x0000ff, 0x00ff00);

source: @days # ($days[0], $days[1],... $days[n])
es: @jornadas # ($jornadas[0], $jornadas[1],... $jornadas[n])

source: @days[3,4,5] # same as ($days[3],$days[4],$days[5])
es: @jornadas[3,4,5] # igual que ($jornadas[3],$jornadas[4],$jornadas[5])

source: @days[3..5] = qw/Wed Thu Fri/;
es: @jornadas[3..5] = qw/Mié Jue Vie/;

source: @days{'a','c'} # same as ($days{'a'},$days{'c'})
es: @jornadas{'a','c'} # igual que ($jornadas{'a'},$jornadas{'c'})

source: @fields = split(/\b(?:a|b|c)\b/)
es: @campos = split(/\b(?:a|b|c)\b/)

source: @fields = split(/\b(a|b|c)\b/)
es: @campos = split(/\b(a|b|c)\b/)

source: @folks[0, -1] = @folks[-1, 0];
es: @gente[0, -1] = @gente[-1, 0];

source: @matches = ( 'foo' =~ m{ o?
es: @coincidencias = ( 'foo' =~ m{ o?

source: @myarray = (5, 50, 500, 5000);
es: @miarray = (5, 50, 500, 5000);

source: @sauces = <<End_Lines =~ m/(\S.*\S)/g;
es: @salsas = <<Fin =~ m/(\S.*\S)/g;

source: @them = @folks[0 ..
es: @ellos = @gente[0 ..

source: @whatever = ();
es: @algo = ();

source: A constructor is simply a class method that returns a reference to a new object.
es: Un constructor es sencillamente un método de la clase que devuelve una referencia a un objeto nuevo.

source: A given file can have multiple links to it.
es: Un archivo determinado puede tener varios vínculos asociados.

source: A method is simply a regular subroutine, and is declared with C<sub>.
es: Un método es simplemente una subrutina normal y se declara con C<sub>.

source: A number of popular modules are included with the Perl distribution itself.
es: La distribución de Perl incluye muchos módulos populares.

source: A package is simply a namespace containing variables and subroutines.
es: Un paquete es simplemente un espacio de nombres que contiene variables y subrutinas.

source: A potential problem caught by C<use strict;> will cause your code to stop immediately when it is encountered, while C<use warnings;> will merely give a warning (like the command-line switch B<-w>) and let your code run.
es: Un posible problema detectado por C<use strict;> hará que el código se detenga inmediatamente, mientras que C<use warnings;> (al igual que el modificador de línea de comandos B<-w>) sólo mostrará una advertencia y dejará que el código se ejecute.

source: A thing that functions grammatically as an L</operand> for the operators in an expression.
es: Cosa que desempeña el rol gramatical de un L</operando> para los operadores de una expresión.

source: A thread with protected memory.
es: Es un hilo de ejecución con memoria protegida.

source: A "constructor" for a L</referent> that isn't really an L</object>, like an anonymous array or a hash (or a sonata, for that matter).
es: "Constructor" para un L</referente> que en realidad no es un L</objeto>, como un array o un hash anónimos (o, ya puestos, una sonata).

source: A "page" from the manuals, typically accessed via the I<man>(1) command.
es: "Página" de los manuales que se suele consultar mediante el comando I<man>(1).

source: A "pointer value", which is Perl Internals Talk for a C<char*>.
es: Un valor de puntero ("pointer value"), que en la jerga de componentes internos de Perl equivale a C<char*>.

source: A "version" or "vector" L</string> specified with a C<v> followed by a series of decimal integers in dot notation, for instance, C<v1.20.300.4000>.
es: L<Cadena|/cadena> de "versión" o de tipo "vector" especificada mediante C<v> seguida de una serie de enteros decimales separados por puntos; por ejemplo, C<v1.20.300.4000>.

source: A "wildcard" match on L<filenames|/filename>.
es: Detección con "comodines" en L<nombres de archivos|/nombre de archivo>.

source: A B<blessed> data structure (aka "a referent") is an object.
es: Una estructura de datos B<bendecida> (también conocida como "referente") es un objeto.

source: A B<class> defines the behavior of a category of objects.
es: Una B<clase> define el comportamiento de una categoría de objetos.

source: A B<constructor> creates a new object.
es: Un B<constructor> crea un nuevo objeto.

source: A C header file has a I<.h> extension.
es: Los archivos de encabezado de C tienen la extensión I<.h>.

source: A C<BEGIN> code block is executed as soon as possible, that is, the moment it is completely defined, even before the rest of the containing file (or string) is parsed.
es: Un bloque de código C<BEGIN> se ejecuta tan pronto como es posible, es decir, en el momento en que está completamente definido, incluso antes del análisis del resto del archivo (o cadena) que lo contiene.

source: A Greco-Roman word meaning "to bring oneself to life".
es: Palabra grecorromana que significa "darse vida a uno mismo".

source: A L</bit shift> that divides a number by some power of 2.
es: L<Desplazamiento de bits|/desplazamiento de bits> que divide un número por alguna potencia de 2.

source: A L</bit shift> that multiplies the number by some power of 2.
es: L<Desplazamiento de bits|/desplazamiento de bits> que multiplica un número por alguna potencia de 2.

source: A L</character> or L</string> that keeps two surrounding strings from being confused with each other.
es: L<Carácter|/carácter> o L</cadena> que evita que dos cadenas se confundan.

source: A L</character> or L</string> that marks the end of another string.
es: L<Carácter|/carácter> o L</cadena> que marca el final de otra cadena.

source: A L</character> or L</string> that sets bounds to an arbitrarily-sized textual object, not to be confused with a L</separator> or L</terminator>.
es: L<Carácter|/carácter> o L</cadena> que establece límites en un objeto de texto de tamaño arbitrario; no debe confundirse con un L</separador> o un L</terminador>.

source: A L</character> that is I<not> supposed to be treated normally.
es: L<Carácter|/carácter> que I<no> debe procesarse como un carácter normal.

source: A L</character> that moves your cursor but doesn't otherwise put anything on your screen.
es: L<Carácter|/carácter> que mueve el cursor pero que no imprime nada en pantalla.

source: A L</class> that defines some of its L<methods|/method> in terms of a more generic class, called a L</base class>.
es: L<Clase|/clase> que define alguno de sus L<métodos|/método> en términos de una clase más genérica, denominada L</clase base>.

source: A L</cluster> used to restrict the scope of a L</regular expression modifier>.
es: L<Clúster|/clúster> usado para restringir el ámbito de un L</modificador de expresión regular>.

source: A L</command> to the computer about what to do next, like a step in a recipe: "Add marmalade to batter and mix until mixed." A statement is distinguished from a L</declaration>, which doesn't tell the computer to do anything, but just to learn something.
es: L<Comando|/comando> que indica al equipo qué debe hacer a continuación, como un paso de una receta: "Añadir mermelada y batir hasta obtener una mezcla homogénea". Una instrucción se distingue de una L</declaración> en que esta última no ordena al equipo que haga nada; simplemente informa de algo.

source: A L</command>-line L</interpreter>.
es: L<Intérprete|/intérprete> de línea de L<comandos|/comando>.

source: A L</conditional> or L</loop> that you put after the L</statement> instead of before, if you know what we mean.
es: L<Condicional|/condicional> o L</bucle> que se coloca a continuación de la L</instrucción>, no antes.

source: A L</cracker> who is not a L</hacker>, but knows just enough to run canned scripts.
es: Un L</cracker> que no es un L</hacker> pero que sabe lo suficiente para ejecutar scripts enlatados.

source: A L</file> that defines a L</package> of (almost) the same name, which can either L</export> symbols or function as an L</object> class.
es: L<Archivo|/archivo> que define un L</paquete> que tiene (casi) el mismo nombre, y que puede L</exportar> símbolos o funcionar como una clase de L</objeto>.

source: A L</file> that is specially marked to tell the L</operating system> that it's okay to run this file as a program.
es: L<Archivo|/archivo> con una marca especial que indica al L</sistema operativo> que se puede ejecutar como un programa.

source: A L</file> that's not a L</directory>, a L</device>, a named L</pipe> or L</socket>, or a L</symbolic link>.
es: L<Archivo|/archivo> que no es un L</directorio>, un L</dispositivo>, una L</tubería> o un L</socket> con nombre, o un L</vínculo simbólico>.

source: A L</function> call directly to the L</operating system>.
es: Llamada de L</función> dirigida directamente al L</sistema operativo>.

source: A L</function> that is predefined in the language.
es: L<Función|/función> predefinida del lenguaje.

source: A L</handler> that you register with some other part of your program in the hope that the other part of your program will L</trigger> your handler when some event of interest transpires.
es: L<Controlador|/controlador> que se registra con alguna parte del programa para que otra parte del programa lo L<desencadene|/desencadenador> cuando se produzca algún evento de interés.

source: A L</hash> with a closed set of allowed keys.
es: L<Hash|/hash> con un conjunto cerrado de claves permitidas.

source: A L</lexical variable> that is declared with a L</class> type: C<my Pony $bill>.
es: L<Variable léxica|/variable léxica> que se declara con un tipo de L</clase>: C<my Pony $guillermo>.

source: A L</method> used to indirectly inspect or update an L</object>'s state (its L<instance variables|/instance variable>).
es: L<Método|/método> que se usa para actualizar o inspeccionar de forma indirecta el estado de un L</objeto> (sus L<variables de instancia|/variable de instancia>).

source: A L</method> whose L</invocant> is a L</package> name, not an L</object> reference.
es: L<Método|/método> cuyo L</invocante> es un nombre de L</paquete>, no una referencia a L</objeto>.

source: A L</namespace> for global L<variables|/variable>, L<subroutines|/subroutine>, and the like, such that they can be kept separate from like-named L<symbols|/symbol> in other namespaces.
es: L<Espacio de nombre|/espacio de nombres> para L<variables|/variable> globales, L<subrutinas|/subrutina>, etc., que permite distinguirlas de L<símbolos|/símbolo> con el mismo nombre de otros espacios de nombres.

source: A L</pipe> with a name embedded in the L</filesystem> so that it can be accessed by two unrelated L<processes|/process>.
es: L<Tubería|/tubería> con un nombre incrustado en el L</sistema de archivos>, de forma que dos L<procesos|/proceso> no relacionados puedan acceder a dicha conexión.

source: A L</pod> directive.
es: Directiva L</pod>.

source: A L</pumpkin> holder, the person in charge of pumping the pump, or at least priming it.
es: La persona que tiene la L</calabaza de parches> en su poder, el encargado de activar la bomba, o al menos de cebarla.

source: A L</regular expression> component potentially matching a L</substring> containing one or more characters and treated as an indivisible syntactic unit by any following L</quantifier>.
es: Componente de L</expresión regular> que puede coincidir con una L</subcadena> de uno o más caracteres y que cualquier L</cuantificador> que venga a continuación puede tratar como una unidad sintáctica indivisible.

source: A L</regular expression> subpattern whose real purpose is to execute some Perl code, for example, the C<(?{...})> and C<(??{...})> subpatterns.
es: Subpatrón de L</expresión regular> cuyo propósito real es ejecutar código Perl, como por ejemplo los subpatrones C<(?{...})> y C<(??{...})>.

source: A L</scalar> L</value> containing the actual address of a L</referent>, such that the referent's L</reference> count accounts for it.
es: L<Valor|/valor> L</escalar> que contiene la dirección real de un L</referente>, de forma que el recuento de L<referencias|/referencia> del referente la tenga en cuenta.

source: A L</string> containing no characters, not to be confused with a string containing a L</null character>, which has a positive length and is L</true>.
es: L<Cadena|/cadena> que no contiene ningún carácter; no debe confundirse con las cadena que contienen un L</carácter nulo>, que tienen una longitud positiva y cuyo valor booleano es L</verdadero>.

source: A L</string> or L</file> containing primarily printable characters.
es: L<Cadena|/cadena> o L</archivo> que contiene principalmente caracteres que se pueden imprimir.

source: A L</subpattern> whose L</quantifier> wants to match as many things as possible.
es: Se dice de un L</subpatrón> cuyo L</cuantificador> desea detectar la mayor cantidad posible de cosas.

source: A L</subroutine> or L</method> that is called by Perl when your program needs to respond to some internal event, such as a L</signal>, or an encounter with an operator subject to L</operator overloading>.
es: L<Subrutina|/subrutina> o L</método> que Perl llama cuando el programa debe responder a algún evento interno, como una L</señal>, o un encuentro con un operador sujeto a L</sobrecarga de operador>.

source: A L</subroutine> that, instead of being content to be called in the normal fashion, sits around waiting for a bolt out of the blue before it will deign to L</execute>.
es: L<Subrutina|/subrutina> que, en lugar de contentarse con recibir las llamadas habituales, espera a que salga un rayo de la nada antes de dignarse a L<ejecutarse|/ejecutar>.

source: A L</subroutine>.
es: Una L</subrutina>.

source: A L</symbol> such as C<+> or C</> that tells Perl to do the arithmetic you were supposed to learn in grade school.
es: L<Símbolo|/símbolo>, como C<+> o C</>, que indica a Perl que haga una de las operaciones aritméticas que aprendimos en el colegio.

source: A L</value> chosen for you if you don't supply a value of your own.
es: L<Valor|/valor> elegido automáticamente si no se proporciona un valor.

source: A L</value> that indicates the position of a particular L</array> L</element> in an array.
es: L<Valor|/valor> que indica la posición de un L</elemento> de L</array> concreto de un array.

source: A L</value> that you might find on the right side of an L</assignment>.
es: L<Valor|/valor> que se encuentra en el lado derecho de una L</asignación>.

source: A L</variable> in a language like C that contains the exact memory location of some other item.
es: En un lenguaje como C, es una L</variable> que contiene la posición exacta de algún elemento en la memoria.

source: A L</variable> prefixed with C<$> that holds a single value.
es: L<Variable|/variable> con el prefijo C<$> que contiene un único valor.

source: A L</variable> subject to L</lexical scoping>, declared by L<my|perlfunc/my>.
es: L<Variable|/variable> sujeta a L</control de ámbito léxico>, declarada con L<my|perlfunc/my>.

source: A LIFO is usually called a L</stack>.
es: LIFO también se suele llamar L</pila>.

source: A Perl Mongers chapter is a local user group which typically holds regular in-person meetings, both social and technical; helps organize local conferences, workshops, and hackathons; and provides a mailing list or other continual contact method for its members to keep in touch.
es: Un grupo de Perl Mongers es un grupo de usuarios local que organiza regularmente reuniones presenciales, tanto sociales como técnicas, ayuda a organizar conferencias, talleres y I<hackathons> locales, y proporciona una lista de correo u otro medio de contacto continuo entre sus miembros.

source: A Perl module that also pulls in compiled C or C++ code.
es: Módulo Perl que también usa código C o C++ compilado.

source: A Perl program's C<DESTROY> method doesn't do the actual destruction; Perl just L<triggers|/trigger> the method in case the L</class> wants to do any associated cleanup.
es: En realidad, el método C<DESTROY> de un programa Perl no se encarga de la destrucción; Perl solo L<desencadena|/desencadenador> el método en caso de que la L</clase> desee realizar alguna limpieza asociada.

source: A Perl script or program consists of one or more statements.
es: Un script o programa Perl consta de una o varias instrucciones.

source: A backreference matches whatever actually matched the subpattern in the string being examined, not the rules for that subpattern.
es: Una retrorreferencia coincide con lo que coincidía realmente el subpatrón en la cadena examinada, no con las reglas de ese subpatrón.

source: A bare, single L</statement>, without any braces, hanging off an C<if> or C<while> conditional.
es: L<Instrucción|/instrucción> individual suelta, sin llaves, que cuelga de un condicional C<if> o C<while>.

source: A basic building block.
es: Componente básico.

source: A bit of code that does "dwimming" is a "dwimmer".
es: Se dice que un fragmento de código con esta propiedad es un "dwimmer".

source: A bolt out of the blue; that is, an event triggered by the L</operating system>, probably when you're least expecting it.
es: Un rayo surgido de la nada; es decir, un evento desencadenado por el L</sistema operativo>, probablemente cuando menos se espera.

source: A built-in unary operator that you use to determine whether something is L</true> about a file, such as C<-o $filename> to test whether you're the owner of the file.
es: Operador unario predefinido que se usa para determinar si algo referido a un archivo es L</verdadero>, como C<-o $archivo> para comprobar si se es el propietario del archivo.

source: A cargo-cult programmer.
es: Un programador que no sabe lo que se trae entre manos.

source: A categorized list of modules is also available from CPAN.
es: En CPAN también está disponible una lista de módulos clasificados por categorías.

source: A character set comprising all the major character sets of the world, more or less.
es: Juego de caracteres que contiene prácticamente todos los juegos de caracteres usados en el planeta.

source: A character with the ASCII value of zero.
es: Carácter con el valor ASCII cero.

source: A class is a name for a category (like "File"), and a class also defines the behavior of objects in that category.
es: Es un nombre para una categoría (como "Archivo"); también define el comportamiento de los objetos de esa categoría.

source: A class is simply a package.
es: Una clase no es más que un paquete.

source: A class provides methods that expect to operate on objects.
es: Una clase proporciona métodos que deben aplicarse a objetos.

source: A command-line front-end to C<Module::CoreList>, to query what modules were shipped with given versions of perl.
es: Este front-end de línea de comandos de C<Module::CoreList> permite consultar la lista de módulos incluidos en versiones específicas de perl.

source: A comment.
es: Un comentario.

source: A common abuse of this power stems from the ability to make infinite loops using regular expressions, with something as innocuous as:
es: Un abuso común de esta eficacia se deriva de la capacidad de crear bucles infinitos mediante expresiones regulares, con algo tan inocuo como:

source: A component of a L</regular expression> pattern.
es: Componente de un patrón de L</expresión regular>.

source: A component of a L</regular expression> specifying how many times the foregoing L</atom> may occur.
es: Componente de una L</expresión regular> que especifica cuántas veces puede ocurrir el L</átomo> precedente.

source: A component of a L</regular expression> that must be true for the pattern to match but does not necessarily match any characters itself.
es: Componente de una L</expresión regular> que debe ser verdadero para que el patrón coincida, pero que no tiene por qué coincidir necesariamente con ningún carácter.

source: A comprehensive list of Perl-related mailing lists can be found at L<http://lists.perl.org/>
es: Encontrará una lista completa de listas de correo relacionadas con Perl en L<http://lists.perl.org/>
